<?php

// 1. Придумайте класс, который описывает любую сущность из предметной области библиотеки: книга, шкаф, комната и т.п.

// 2. Опишите свойства классов из п.1 (состояние).

// 3. Опишите поведение классов из п.1 (методы).

// 4. Придумайте наследников классов из п.1. Чем они будут отличаться?

// 5. Создайте структуру классов ведения книжной номенклатуры.
// — Есть абстрактная книга.
// — Есть цифровая книга, бумажная книга.
// — У каждой книги есть метод получения на руки.

// У цифровой книги надо вернуть ссылку на скачивание, а у физической – адрес библиотеки, где ее можно получить. У всех книг формируется в конечном итоге статистика по кол-ву прочтений.
// Что можно вынести в абстрактный класс, а что надо унаследовать?

require_once 'vendor/autoload.php';

use Root\Code\DigitalBook;
use Root\Code\PaperBook;
use Root\Code\Bookshelf;

$book = new PaperBook("Технология Варп Двигателя", "Наследие Предков", 2022, "Местная Библиотека");
$Dbook = new DigitalBook("Свойтва гиперпространства", "Наследие Предков", 2022, "https://www.library.com");

$info = $book->description();

echo $info;

echo $book->gettingBook();
echo $book->returnBook();

echo "\n";

$info = $Dbook->description();

echo $info;

echo $Dbook->getBook();

echo "===============================================\n";

$booksShelf = new Bookshelf();

$booksShelf->addBook($book);

$booksShelf->showBooks();


